RT-Thread/rt-thread/bsp/stm32f20x/stm32f2xx_eth.c
  return bitstatus;
}

/**
  * @brief  Get the specified ETHERNET MMC register value.
  * @param  ETH_MMCReg: specifies the ETHERNET MMC register.
  *   This parameter can be one of the following values:
  *     @arg ETH_MMCCR      : MMC CR register 
  *     @arg ETH_MMCRIR     : MMC RIR register 
  *     @arg ETH_MMCTIR     : MMC TIR register 
  *     @arg ETH_MMCRIMR    : MMC RIMR register 
  *     @arg ETH_MMCTIMR    : MMC TIMR register 
  *     @arg ETH_MMCTGFSCCR : MMC TGFSCCR register 
  *     @arg ETH_MMCTGFMSCCR: MMC TGFMSCCR register  
  *     @arg ETH_MMCTGFCR   : MMC TGFCR register
  *     @arg ETH_MMCRFCECR  : MMC RFCECR register 
  *     @arg ETH_MMCRFAECR  : MMC RFAECR register 
  *     @arg ETH_MMCRGUFCR  : MMC RGUFCRregister 
  * @retval The value of ETHERNET MMC Register value.
  */
uint32_t ETH_GetMMCRegister(uint32_t ETH_MMCReg)
{
  /* Check the parameters */
  assert_param(IS_ETH_MMC_REGISTER(ETH_MMCReg));
  
  /* Return the selected register value */
  return (*(__IO uint32_t *)(ETH_MAC_BASE + ETH_MMCReg));
}
/*---------------------------------  PTP  ------------------------------------*/
/**
  * @brief  Sets the PTP node clock type.
  * @param  ClockType: specifies the PTP node clock type.
  *   This parameter can be one of the following values:
  *     @arg ETH_PTP_OrdinaryClock : Ordinary Clock. 
  *     @arg ETH_PTP_BoundaryClock : Boundary Clock.
  *     @arg ETH_PTP_EndToEndTransparentClock : End To End Transparent Clock. 
  *     @arg ETH_PTP_PeerToPeerTransparentClock : Peer To Peer Transparent Clock.  
  * @retval None
  */
void ETH_PTPNodeClockTypeConfig(uint32_t ClockType)
{
  /* Check the parameters */
  assert_param(IS_ETH_PTP_TYPE_CLOCK(ClockType));  

  /* Clear the PTP node clock type */
  ETH->PTPTSCR &= (~(uint32_t)ETH_PTPTSCR_TSCNT); 
  
  /* Set the new PTP node clock type */
  ETH->PTPTSCR |= ClockType;   
}

/**
  * @brief  Enables or disables the selected PTP snapshot method.
  * @param  SnapshotMethod: specifies the PTP snapshot method.
  *   This parameter can be one of the following values:
  *     @arg ETH_PTP_SnapshotMasterMessage  : snapshot for message relevant to master. 
  *     @arg ETH_PTP_SnapshotEventMessage   : snapshot for event message.
  *     @arg ETH_PTP_SnapshotIPV4Frames     : snapshot for IPv4 frames. 
  *     @arg ETH_PTP_SnapshotIPV6Frames     : snapshot for IPv6 frames.
  *     @arg ETH_PTP_SnapshotPTPOverEthernetFrames : snapshot for PTP over ethernet frames. 
  *     @arg ETH_PTP_SnapshotAllReceivedFrames      : snapshot for all received frames. 
  * @param  NewState: new state of the PTP snapshot method
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_PTPSnapshotCmd(uint32_t SnapshotMethod, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_ETH_PTP_SNAPSHOT(SnapshotMethod));
  assert_param(IS_FUNCTIONAL_STATE(NewState));   
  
  if (NewState != DISABLE)
  {
    /* Enable the selected PTP snapshot method */
    ETH->PTPTSCR |= SnapshotMethod;
  }
  else
  {
    /* Disable the selected PTP snapshot method */
    ETH->PTPTSCR &= (~(uint32_t)SnapshotMethod);
  }
}

/**
  * @brief  Enables or disables the PTP packet snooping version 2 format.
  * @param  NewState: new state of the PTP packet snooping version 2 format
  *   This parameter can be: ENABLE or DISABLE. 
  * @retval None
  */
void ETH_PTPPacketSnoopingV2FormatCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the PTP packet snooping version 2 format */
    ETH->PTPTSCR |= ETH_PTPTSSR_TSPTPPSV2E;
  }
  else
  {
    /* Disable the PTP packet snooping version 2 format */
    ETH->PTPTSCR &= (~(uint32_t)ETH_PTPTSSR_TSPTPPSV2E);
  }
}

/**
  * @brief  Enables or disables the PTP Subsecond rollover.
  * @param  NewState: new state of the PTP Subsecond rollover
  *   This parameter can be: ENABLE or DISABLE. 
  * @retval None
  */
void ETH_PTPSubSecondRolloverCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the PTP Subsecond rollover */
    ETH->PTPTSCR |= ETH_PTPTSSR_TSSSR;
  }
  else
  {
    /* Disable the PTP Subsecond rollover */
    ETH->PTPTSCR &= (~(uint32_t)ETH_PTPTSSR_TSSSR);
  }
}

/**
  * @brief  Updated the PTP block for fine correction with the Time Stamp Addend register value.
  * @param  None
  * @retval None
  */
void ETH_EnablePTPTimeStampAddend(void)
{
  /* Enable the PTP block update with the Time Stamp Addend register value */
  ETH->PTPTSCR |= ETH_PTPTSCR_TSARU;    
}

/**
  * @brief  Enable the PTP Time Stamp interrupt trigger
  * @param  None
  * @retval None
  */
void ETH_EnablePTPTimeStampInterruptTrigger(void)
{
  /* Enable the PTP target time interrupt */
  ETH->PTPTSCR |= ETH_PTPTSCR_TSITE;    
}

/**
  * @brief  Updated the PTP system time with the Time Stamp Update register value.
  * @param  None
  * @retval None
  */
void ETH_EnablePTPTimeStampUpdate(void)
{
  /* Enable the PTP system time update with the Time Stamp Update register value */
  ETH->PTPTSCR |= ETH_PTPTSCR_TSSTU;    
}

/**
  * @brief  Initialize the PTP Time Stamp
  * @param  None
  * @retval None
  */
void ETH_InitializePTPTimeStamp(void)
{
  /* Initialize the PTP Time Stamp */
  ETH->PTPTSCR |= ETH_PTPTSCR_TSSTI;    
}

/**
  * @brief  Selects the PTP Update method
  * @param  UpdateMethod: the PTP Update method
  *   This parameter can be one of the following values:
  *     @arg ETH_PTP_FineUpdate   : Fine Update method 
  *     @arg ETH_PTP_CoarseUpdate : Coarse Update method 
  * @retval None
  */
void ETH_PTPUpdateMethodConfig(uint32_t UpdateMethod)
{
  /* Check the parameters */
  assert_param(IS_ETH_PTP_UPDATE(UpdateMethod));
  
  if (UpdateMethod != ETH_PTP_CoarseUpdate)
  {
    /* Enable the PTP Fine Update method */
    ETH->PTPTSCR |= ETH_PTPTSCR_TSFCU;
  }
  else
  {
    /* Disable the PTP Coarse Update method */
    ETH->PTPTSCR &= (~(uint32_t)ETH_PTPTSCR_TSFCU);
  } 
}

/**
  * @brief  Enables or disables the PTP time stamp for transmit and receive frames.
  * @param  NewState: new state of the PTP time stamp for transmit and receive frames
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_PTPTimeStampCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the PTP time stamp for transmit and receive frames */
    ETH->PTPTSCR |= ETH_PTPTSCR_TSE;
  }
  else
  {
    /* Disable the PTP time stamp for transmit and receive frames */
    ETH->PTPTSCR &= (~(uint32_t)ETH_PTPTSCR_TSE);
  }
}

/**
  * @brief  Checks whether the specified ETHERNET PTP flag is set or not.
  * @param  ETH_PTP_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg ETH_PTP_FLAG_TSARU : Addend Register Update 
  *     @arg ETH_PTP_FLAG_TSITE : Time Stamp Interrupt Trigger Enable 
  *     @arg ETH_PTP_FLAG_TSSTU : Time Stamp Update 
  *     @arg ETH_PTP_FLAG_TSSTI  : Time Stamp Initialize                       
  * @retval The new state of ETHERNET PTP Flag (SET or RESET).
  */
FlagStatus ETH_GetPTPFlagStatus(uint32_t ETH_PTP_FLAG)
{
  uint32_t flagpos = 0x0;
  FlagStatus bitstatus = RESET;
  uint32_t ethernetreg = 0x0;

  /* Check the parameters */
  assert_param(IS_ETH_PTP_GET_FLAG(ETH_PTP_FLAG));

  /* Get the Flag position */
  flagpos &= 0xEFFFFFFF;

