RT-Thread/rt-thread/bsp/stm32f20x/stm32f2xx_eth.c
	return RT_EOK;
}

/* ethernet device interface */
/* transmit packet. */
rt_err_t rt_stm32_eth_tx( rt_device_t dev, struct pbuf* p)
{
	struct pbuf* q;
	rt_uint32_t offset;

	/* Check if the descriptor is owned by the ETHERNET DMA (when set) or CPU (when reset) */
	while ((DMATxDescToSet->Status & ETH_DMATxDesc_OWN) != (uint32_t)RESET)
	{
		rt_err_t result;
		rt_uint32_t level;

		level = rt_hw_interrupt_disable();
		tx_is_waiting = RT_TRUE;
		rt_hw_interrupt_enable(level);

		/* it's own bit set, wait it */
		result = rt_sem_take(&tx_wait, RT_WAITING_FOREVER);
		if (result == RT_EOK) break;
		if (result == -RT_ERROR) return -RT_ERROR;
	}

	offset = 0;
	for (q = p; q != NULL; q = q->next)
	{
		rt_uint8_t* ptr;
		rt_uint32_t len;

		len = q->len;
		ptr = q->payload;

		/* Copy the frame to be sent into memory pointed by the current ETHERNET DMA Tx descriptor */
		while (len)
		{
			(*(__IO uint8_t *)((DMATxDescToSet->Buffer1Addr) + offset)) = *ptr;

			offset ++; ptr ++; len --;
		}
	}

	/* Setting the Frame Length: bits[12:0] */
	DMATxDescToSet->ControlBufferSize = (p->tot_len & ETH_DMATxDesc_TBS1);
	/* Setting the last segment and first segment bits (in this case a frame is transmitted in one descriptor) */
	DMATxDescToSet->Status |= ETH_DMATxDesc_LS | ETH_DMATxDesc_FS;
	/* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
	DMATxDescToSet->Status |= ETH_DMATxDesc_OWN;
	/* When Tx Buffer unavailable flag is set: clear it and resume transmission */
	if ((ETH->DMASR & ETH_DMASR_TBUS) != (uint32_t)RESET)
	{
		/* Clear TBUS ETHERNET DMA flag */
		ETH->DMASR = ETH_DMASR_TBUS;
		/* Transmit Poll Demand to resume DMA transmission*/
		ETH->DMATPDR = 0;
	}

	/* Update the ETHERNET DMA global Tx descriptor with next Tx decriptor */
	/* Chained Mode */
	if((DMATxDescToSet->Status & ETH_DMATxDesc_TCH) != (uint32_t)RESET)
	{
		/* Selects the next DMA Tx descriptor list for next buffer to send */
		DMATxDescToSet = (ETH_DMADESCTypeDef*) (DMATxDescToSet->Buffer2NextDescAddr);
	}
	else /* Ring Mode */
	{
		if((DMATxDescToSet->Status & ETH_DMATxDesc_TER) != (uint32_t)RESET)
		{
			/* Selects the first DMA Tx descriptor for next buffer to send: last Tx descriptor was used */
			DMATxDescToSet = (ETH_DMADESCTypeDef*) (ETH->DMATDLAR);
		}
		else
		{
			/* Selects the next DMA Tx descriptor list for next buffer to send */
			DMATxDescToSet = (ETH_DMADESCTypeDef*) ((uint32_t)DMATxDescToSet + 0x10 + ((ETH->DMABMR & ETH_DMABMR_DSL) >> 2));
		}
	}

	/* Return SUCCESS */
	return RT_EOK;
}

/* reception packet. */
struct pbuf *rt_stm32_eth_rx(rt_device_t dev)
{
	struct pbuf* p;
	rt_uint32_t offset = 0, framelength = 0;

	/* init p pointer */
	p = RT_NULL;

	/* Check if the descriptor is owned by the ETHERNET DMA (when set) or CPU (when reset) */
	if(((DMARxDescToGet->Status & ETH_DMARxDesc_OWN) != (uint32_t)RESET))
		return p;

	if (((DMARxDescToGet->Status & ETH_DMARxDesc_ES) == (uint32_t)RESET) &&
		((DMARxDescToGet->Status & ETH_DMARxDesc_LS) != (uint32_t)RESET) &&
		((DMARxDescToGet->Status & ETH_DMARxDesc_FS) != (uint32_t)RESET))
	{
		/* Get the Frame Length of the received packet: substruct 4 bytes of the CRC */
		framelength = ((DMARxDescToGet->Status & ETH_DMARxDesc_FL) >> ETH_DMARXDESC_FRAME_LENGTHSHIFT) - 4;

		/* allocate buffer */
		p = pbuf_alloc(PBUF_LINK, framelength, PBUF_RAM);
		if (p != RT_NULL)
		{
			rt_uint8_t* ptr;
			struct pbuf* q;
			rt_size_t len;

			for (q = p; q != RT_NULL; q= q->next)
			{
				ptr = q->payload;
				len = q->len;

				/* Copy the received frame into buffer from memory pointed by the current ETHERNET DMA Rx descriptor */
				while (len)
				{
					*ptr = (*(__IO uint8_t *)((DMARxDescToGet->Buffer1Addr) + offset));

					offset ++; ptr ++; len --;
				}
			}
		}
	}

	/* Set Own bit of the Rx descriptor Status: gives the buffer back to ETHERNET DMA */
	DMARxDescToGet->Status = ETH_DMARxDesc_OWN;

	/* When Rx Buffer unavailable flag is set: clear it and resume reception */
	if ((ETH->DMASR & ETH_DMASR_RBUS) != (uint32_t)RESET)
	{
		/* Clear RBUS ETHERNET DMA flag */
		ETH->DMASR = ETH_DMASR_RBUS;
		/* Resume DMA reception */
		ETH->DMARPDR = 0;
	}

	/* Update the ETHERNET DMA global Rx descriptor with next Rx decriptor */
	/* Chained Mode */
	if((DMARxDescToGet->ControlBufferSize & ETH_DMARxDesc_RCH) != (uint32_t)RESET)
	{
		/* Selects the next DMA Rx descriptor list for next buffer to read */
		DMARxDescToGet = (ETH_DMADESCTypeDef*) (DMARxDescToGet->Buffer2NextDescAddr);
	}
	else /* Ring Mode */
	{
		if((DMARxDescToGet->ControlBufferSize & ETH_DMARxDesc_RER) != (uint32_t)RESET)
		{
			/* Selects the first DMA Rx descriptor for next buffer to read: last Rx descriptor was used */
			DMARxDescToGet = (ETH_DMADESCTypeDef*) (ETH->DMARDLAR);
		}
		else
		{
			/* Selects the next DMA Rx descriptor list for next buffer to read */
			DMARxDescToGet = (ETH_DMADESCTypeDef*) ((uint32_t)DMARxDescToGet + 0x10 + ((ETH->DMABMR & ETH_DMABMR_DSL) >> 2));
		}
	}

	return p;
}

static void RCC_Configuration(void)
{
	/* Enable GPIOs clocks */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB |
						 RCC_AHB1Periph_GPIOC, ENABLE);

	/* Enable SYSCFG and ADC3 clocks */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG | RCC_APB2Periph_ADC3, ENABLE);

	/* Enable MAC clocks */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_ETH_MAC | RCC_AHB1Periph_ETH_MAC_Tx |
						RCC_AHB1Periph_ETH_MAC_Rx, ENABLE);	
}

static void NVIC_Configuration(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;

  /* Enable the Ethernet global Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = ETH_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);    
}

